<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <meta http-equiv="X-UA-Compatible" content="ie=edge" />
    <link
      href="assets/vendor/bootstrap/css/bootstrap.min.css"
      rel="stylesheet"
    />
    <link href="assets/css/works.css" rel="stylesheet" />
  </head>
  <body>
    <div class="container my-5">
      <div class="row">
        <div class="col-2">
          <h4 class="m-0">Links dos documentos</h4>
          <ul class="nav flex-column">
            <li class="nav-item">
              <a
                class="nav-link"
                target="_blank"
                href="assets/pdfs/propostas.pdf"
                >Primeira proposta</a
              >
            </li>
            <li class="nav-item">
              <a
                class="nav-link active"
                target="_blank"
                href="https://docs.google.com/document/d/1A9k35DDd941rFjob2RWLCh6gpCCqAJchM6_7mqR2Da0/edit?usp=sharing"
                >PG 1</a
              >
            </li>
            <li class="nav-item">
              <a
                class="nav-link"
                target="_blank"
                href="https://docs.google.com/document/d/1ztnptMx98fcZhArYE3gFBGvnjCKtyDVgiQjpFY4gWfo/edit?usp=sharing"
                >Roteiro entrevistas</a
              >
            </li>
            <li class="nav-item">
              <a
                class="nav-link"
                target="_blank"
                href="https://www.figma.com/proto/3MGQeacU3Sevn1qS4ENcv6/Prot%C3%B3tipo-Rascunho?node-id=1-3&scaling=contain&page-id=0%3A1&starting-point-node-id=1%3A3"
                >Protótipo</a
              >
            </li>
            <li class="nav-item">
              <a
                class="nav-link"
                target="_blank"
                href="https://www.figma.com/file/zBDk0drSaxzZpADsMHxVqx/Op%C3%A7%C3%B5es-poss%C3%ADveis-%E2%80%94-arvore-de-decis%C3%A3o?node-id=0%3A1&t=P7rVfKCSb6fnQJ8F-1"
                >Árvore de decisão</a
              >
            </li>
          </ul>
        </div>
        <div class="col-8">
          <div class="row justify-content-center">
            <div class="col-12">
              <div class="meta">
                <div class="info">
                  <h1>Mayara Viana - PG</h1>
                  <p class="subtitle">Página de resumo e links</p>
                </div>
              </div>
            </div>
          </div>
          <div class="row justify-content-center">
            <div class="col-12">
              <main class="article">
                <h2 class="m-0" id="introducao">Introdu&ccedil;&atilde;o:</h2>
                <p>
                  <span class="first-letter">E</span>u acho que a primeira coisa
                  que eu deveria colocar aqui &eacute; um resumo geral, sobre o
                  come&ccedil;o sobre a minha proposta ate os dias de agora. Eu
                  coloquei aqui um resumo brevemente s&oacute; para relembrar.
                </p>

                <h2 id="primeira-proposta">Primeira proposta</h2>

                <p>
                  Eu recortei apenas as p&aacute;ginas das propostas do meu
                  arquivo, no final eu escolhi a proposta 1.
                </p>
                <a
                  class="nav-link"
                  target="_blank"
                  href="assets/pdfs/propostas.pdf"
                  >Primeira proposta</a
                >
                <p>
                  Acho que a minha ideia nesse momento era realmente fazer algo
                  que trabalhasse com linguagem natural e algo bem mais abstrato
                  da vis&atilde;o do usu&aacute;rio pudesse ser inserido. Depois
                  de estudar um pouco sobre o desenvolvimento da coisa, eu achei
                  que seria muito trabalhoso.
                </p>

                <h2 id="pg1">PG1</h2>

                <p>
                  Esse &eacute; o meu arquivo de PG 1, acho que n&atilde;o tem
                  muito o que falar nessa parte. Eu estava confusa sobre o que
                  ia dar, mas só colocando aqui para registro.
                </p>
                <a
                  class="nav-link active"
                  target="_blank"
                  href="https://docs.google.com/document/d/1A9k35DDd941rFjob2RWLCh6gpCCqAJchM6_7mqR2Da0/edit?usp=sharing"
                  >PG 1</a
                >

                <h2 id="como-mudou">Como mudou</h2>

                <p>
                  A ideia principal do meu software &eacute; pegar
                  usu&aacute;rios que n&atilde;o sabem nada de design e muito
                  pouco de computa&ccedil;&atilde;o e que precisam de um site
                  landing page para seus usos pessoais ou neg&oacute;cios e
                  consigam realizar essa tarefa da maneira mais f&aacute;cil e
                  compreensiva para eles. Ent&atilde;o as minhas perguntas
                  sempre foram:
                </p>

                <ul>
                  <li>
                    Primeiro de tudo, eles sabem come&ccedil;ar? Sabem sobre a
                    exist&ecirc;ncia desses sites de constru&ccedil;&atilde;o de
                    sites?
                  </li>
                  <li>
                    Ser&aacute; que eles consegue entender essas ferramentas
                    como Wix, Wordpress?&nbsp;
                  </li>
                  <li>
                    Esse conceito que muitos desses sites usam de arrastar os
                    blocos um debaixo do outro &eacute; f&aacute;cil?&nbsp;
                  </li>
                  <li>
                    Ser&aacute; que eles conseguem entender que para mudar um
                    texto na tela &eacute; s&oacute; clicar nele e digitar?
                  </li>
                  <li>
                    Ser&aacute; que esses usu&aacute;rios atualmente sabem mais
                    ou menos que cores e fontes usar para passar a
                    impress&atilde;o que eles querem no negocio deles?&nbsp;
                  </li>
                  <li>
                    Ser&aacute; que eles consegue entender de hierarquia e
                    sozinhos conseguem fazer algo com uma boa UX?&nbsp;
                  </li>
                  <li>Como podemos resolver esses problemas?&nbsp;</li>
                  <li>Isso s&atilde;o problemas reais?</li>
                </ul>

                <p>
                  Agora com a apari&ccedil;&atilde;o de ferramentas de input de
                  texto e AI muitas coisas mudaram. Ser&aacute; que trabalhar
                  dessa maneira &eacute; bom para esse p&uacute;blico?
                  Ferramentas como chat GPT s&atilde;o incr&iacute;veis para
                  quem sabe, no m&iacute;nimo, o que pedir.
                </p>

                <p>
                  Depois que eu pensei em todas essas perguntas, eu percebi que
                  minha pesquisa estavam muito mal embasada. Eu n&atilde;o
                  perten&ccedil;o a esse publico, ent&atilde;o tudo que eu tenho
                  em mente s&atilde;o suposi&ccedil;&otilde;es.
                </p>

                <p>
                  Decidi fazer testes com os usu&aacute;rios e o no final do meu
                  PG2 eu e o Edson est&aacute;vamos trabalhando nesse documento:
                </p>
                <a
                  class="nav-link"
                  target="_blank"
                  href="https://docs.google.com/document/d/1ztnptMx98fcZhArYE3gFBGvnjCKtyDVgiQjpFY4gWfo/edit?usp=sharing"
                  >Roteiro Entrevistas</a
                >
                <p>
                  Eu j&aacute; realizei alguns testes pilotos, ainda n&atilde;o
                  consegui transcrever. Mas acredito que algumas coisas
                  ter&atilde;o que mudar nesse teste.
                </p>

                <h2 id="eu-penso">
                  O que eu penso j&aacute; h&aacute; muito tempo
                </h2>

                <p>
                  Eu acho que desde que eu comecei essa proposta eu j&aacute;
                  tinha uma solu&ccedil;&atilde;o mais ou menos na minha
                  cabe&ccedil;a, eu queria fazer uma ferramenta bem sanduiche e
                  iniciante, ent&atilde;o eu meio que j&aacute; tenho alguns
                  arquivos criados:
                </p>

                <p>
                  Esse arquivo no Figma mostra um pouco da minha ideia de
                  maneira interativa, acho que mostrar assim e melhor do que eu
                  explicar:
                </p>
                <a
                  class="nav-link"
                  target="_blank"
                  href="https://www.figma.com/proto/3MGQeacU3Sevn1qS4ENcv6/Prot%C3%B3tipo-Rascunho?node-id=1-3&scaling=contain&page-id=0%3A1&starting-point-node-id=1%3A3"
                  >Protótipo</a
                >

                <p>
                  E aqui temos um arquivo que baseado nisso eu fui fazendo quais
                  seriam as op&ccedil;&otilde;es e como seria essa arvore:
                </p>
                <a
                  class="nav-link"
                  target="_blank"
                  href="https://www.figma.com/file/zBDk0drSaxzZpADsMHxVqx/Op%C3%A7%C3%B5es-poss%C3%ADveis-%E2%80%94-arvore-de-decis%C3%A3o?node-id=0%3A1&t=P7rVfKCSb6fnQJ8F-1"
                  >Árvore de decisão</a
                >
                <p>
                  Eu acho que mesmo que os testes dessem todos perfeitos, todo
                  mundo conseguisse utilizar as ferramentas de maneira perfeita,
                  eu gostaria de propor essa ferramenta como um meio do caminho.
                  Algo nem t&atilde;o livre para o usu&aacute;rio e que pegue
                  mais na maozinha dos usu&aacute;rios em passo por passo.
                </p>
                <p>
                  Atenciosamente,<br /><i
                    ><a href="https://mayaraviana.com/">Mayara</a></i
                  >
                </p>
              </main>
            </div>
          </div>
        </div>
        <div class="col-2">
          <ul class="nav flex-column sticky-top">
            <li class="nav-item">
              <a class="nav-link active" href="#introducao">Introdução</a>
            </li>
            <li class="nav-item">
              <a class="nav-link" href="#primeira-proposta"
                >Primeira proposta</a
              >
            </li>
            <li class="nav-item">
              <a class="nav-link" href="#pg1">PG1</a>
            </li>
            <li class="nav-item">
              <a class="nav-link" href="#como-mudou">Como mudou</a>
            </li>
            <li class="nav-item">
              <a class="nav-link" href="#eu-penso"
                >O que eu penso já há muito tempo</a
              >
            </li>
          </ul>
        </div>
      </div>
    </div>
  </body>
</html>
